Tekla.Structures.Drawing.DotPrintOrientationType
The print orientation type.

Tekla.Structures.Drawing.DotPrintOrientationType.Auto
Auto orientation.

Tekla.Structures.Drawing.DotPrintOrientationType.Landscape
Landscape orientation.

Tekla.Structures.Drawing.DotPrintOrientationType.Portrait
Portrait orientation.